Every year, American high school students take SATs, which are standardized tests intended to measure literacy, numeracy, and writing skills. There are three sections - reading, math, and writing, each with a **maximum score of 800 points**. These tests are extremely important for students and colleges, as they play a pivotal role in the admissions process.

Analyzing the performance of schools is important for a variety of stakeholders, including policy and education professionals, researchers, government, and even parents considering which school their children should attend. 

You have been provided with a dataset called `schools.csv`, which is previewed below.

You have been tasked with answering three key questions about New York City (NYC) public school SAT performance.

In [2]:
# Re-run this cell 
import pandas as pd

# Read in the data
schools = pd.read_csv("C:\\Users\\reich\\Downloads\\datacamp-associate-data-scientist\\2PROJETO - Explorando notas de provas de escolas p√∫blicas de NYC\\schools.csv")

# Preview the data
schools.head()

# Start coding here...
# Add as many cells as you like...

,index,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested
0,0,"New Explorations into Science, Technology and ...",Manhattan,M022,657,601,601,NaN
1,1,Essex Street Academy,Manhattan,M445,395,411,387,78.9
2,2,Lower Manhattan Arts Academy,Manhattan,M445,418,428,415,65.1
3,3,High School for Dual Language and Asian Studies,Manhattan,M445,613,453,463,95.9
4,4,Henry Street School for International Studies,Manhattan,M056,410,406,381,59.7

In [3]:
best_math_schools = schools.sort_values('average_math', ascending=False)
best_math_schools = best_math_schools[best_math_schools['average_math'] >= 800 * 0.8]
best_math_schools = best_math_schools[["school_name", "average_math"]]

best_math_schools

                                           school_name  average_math
88                              Stuyvesant High School           754
170                       Bronx High School of Science           714
93                 Staten Island Technical High School           711
365  Queens High School for the Sciences at York Co...           701
68   High School for Mathematics, Science, and Engi...           683
280                     Brooklyn Technical High School           682
333                        Townsend Harris High School           680
174  High School of American Studies at Lehman College           669
0    New Explorations into Science, Technology and ...           657
45                       Eleanor Roosevelt High School           641

In [4]:
top_10_schools = schools
top_10_schools['total_SAT'] = top_10_schools['average_math'] + top_10_schools['average_reading'] + top_10_schools['average_writing']
# top_10_schools['total_SAT'].head

top_10_schools = top_10_schools[['school_name', 'total_SAT']]
top_10_schools = top_10_schools.sort_values('total_SAT', ascending=False).head(10)

top_10_schools

                                           school_name  total_SAT
88                              Stuyvesant High School       2144
93                 Staten Island Technical High School       2041
170                       Bronx High School of Science       2041
174  High School of American Studies at Lehman College       2013
333                        Townsend Harris High School       1981
365  Queens High School for the Sciences at York Co...       1947
5                       Bard High School Early College       1914
280                     Brooklyn Technical High School       1896
68   High School for Mathematics, Science, and Engi...       1889
45                       Eleanor Roosevelt High School       1889

In [5]:
largest_std_dev = schools.groupby('borough')['total_SAT'].agg(['count', 'mean', 'std']).round(2)
largest_std_dev = largest_std_dev[largest_std_dev['std'] == largest_std_dev['std'].max()]
largest_std_dev = largest_std_dev.rename(columns={"count":"num_schools", "mean":"average_SAT", "std":"std_SAT"})
largest_std_dev = largest_std_dev.head(1)
largest_std_dev

           num_schools  average_SAT  std_SAT
borough
Manhattan           89      1340.13   230.29